
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МетодСписания = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).МетодСписания;
	
	
	
	
	Если МетодСписания.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Учетная политика не определена!";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если МетодСписания = Перечисления.МетодыСписанияУчетнойПолитики.FIFO Тогда
		// регистр ОстаткиНоменклатуры Приход
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = ЭтотОбъект.Ссылка;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ЕдиницаИзмеренияНоменклатуры = ТекСтрокаТовары.ЕдИзм;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость =  ТекСтрокаТовары.Цена;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;
		
	Иначе 
		Если МетодСписания = Перечисления.МетодыСписанияУчетнойПолитики.ПоСреднейСебестоимости Тогда
			Движения.ОстаткиНоменклатуры.Записывать = Истина;
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Партия = Документы.ПриходнаяНакладная.ПустаяСсылка();
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.ЕдиницаИзмеренияНоменклатуры = ТекСтрокаТовары.ЕдИзм;
				Движение.Количество = ТекСтрокаТовары.Количество;
				Движение.Стоимость =  ТекСтрокаТовары.Цена;
				Движение.Сумма = ТекСтрокаТовары.Сумма;
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
