&НаКлиенте
Процедура ТоварыКоличествоИлиЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекДанные=Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	
	//Новый документ нельзя вводить задним числом
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка)Тогда
		Если ЭтаФорма.Объект.Дата < НачалоДня(Текущаядата())Тогда
			Отказ=Истина;
			
			ОчиститьСообщения();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Новые документы задним числом не вводятся!"; 
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
